// 게시물 타입 정의
interface PostItem {
  time: string;
  title: string;
  description: string;
  image_url?: string;
  people?: number;
  status: boolean;
  gender?: string;
}

export const posts: PostItem[] = [
  {
    time: "11:00",
    title: "부산 광안리해수욕장",
    status: true,
    description:
      "이 모임은 매주 수요일 오전 11시에 부산 광안리 해수욕장에서 진행됩니다. 남녀 모두 참여 가능하며, 참가 신청은 사전에 완료해야 합니다. 준비물로는 러닝화와 물을 챙겨주시기 바랍니다.",
  },
  {
    time: "11:00",
    title: "부산 광안리해수욕장",
    status: false,
    description:
      "이 모임은 매주 수요일 오전 11시에 부산 광안리 해수욕장에서 진행됩니다. 남녀 모두 참여 가능하며, 참가 신청은 사전에 완료해야 합니다. 준비물로는 러닝화와 물을 챙겨주시기 바랍니다.",
  },
  {
    time: "11:00",
    title: "부산 광안리해수욕장",
    status: true,
    description:
      "이 모임은 매주 수요일 오전 11시에 부산 광안리 해수욕장에서 진행됩니다. 남녀 모두 참여 가능하며, 참가 신청은 사전에 완료해야 합니다. 준비물로는 러닝화와 물을 챙겨주시기 바랍니다.",
  },
  {
    time: "11:00",
    title: "부산 광안리해수욕장",
    status: true,
    description:
      "이 모임은 매주 수요일 오전 11시에 부산 광안리 해수욕장에서 진행됩니다. 남녀 모두 참여 가능하며, 참가 신청은 사전에 완료해야 합니다. 준비물로는 러닝화와 물을 챙겨주시기 바랍니다.",
  },
  {
    time: "11:00",
    title: "부산 광안리해수욕장",
    status: true,
    description:
      "이 모임은 매주 수요일 오전 11시에 부산 광안리 해수욕장에서 진행됩니다. 남녀 모두 참여 가능하며, 참가 신청은 사전에 완료해야 합니다. 준비물로는 러닝화와 물을 챙겨주시기 바랍니다.",
  },
  {
    time: "11:00",
    title: "부산 광안리해수욕장",
    status: true,
    description:
      "이 모임은 매주 수요일 오전 11시에 부산 광안리 해수욕장에서 진행됩니다. 남녀 모두 참여 가능하며, 참가 신청은 사전에 완료해야 합니다. 준비물로는 러닝화와 물을 챙겨주시기 바랍니다.",
  },
  {
    time: "11:00",
    title: "부산 광안리해수욕장",
    status: true,
    description:
      "이 모임은 매주 수요일 오전 11시에 부산 광안리 해수욕장에서 진행됩니다. 남녀 모두 참여 가능하며, 참가 신청은 사전에 완료해야 합니다. 준비물로는 러닝화와 물을 챙겨주시기 바랍니다.",
  },
  {
    time: "11:00",
    title: "부산 광안리해수욕장",
    status: true,
    description:
      "이 모임은 매주 수요일 오전 11시에 부산 광안리 해수욕장에서 진행됩니다. 남녀 모두 참여 가능하며, 참가 신청은 사전에 완료해야 합니다. 준비물로는 러닝화와 물을 챙겨주시기 바랍니다.",
  },
];
